{
  "rules": {
    "brd_text": "# Project Name: Digital Loan Application and Approval System\n\n## Business Requirement Document\n\n### 1. Background\n\nThe loan application process at XYZ Bank is currently manual, paper-based, and requires customers to visit branches physically. This has led to increased turnaround time (TAT), frequent errors, and poor customer experience. The management wants to digitize the entire loan origination process for personal loans.\n\n### 2. As-is Process\n\nThe as-is process steps are documented below (as-is process diagram):\n\n<<Image>>\n\n### 3. Business Requirements\n\n#### 3.1 Functional Requirements\n\n##### 3.1.1 Process Details\n\n- Online loan application form with Aadhaar/PAN-based prefill.\n- Integration with credit bureau (CIBIL) to fetch credit score.\n- AI-based eligibility and risk assessment module.\n- Real-time KYC document verification (OCR + face match).\n- Loan sanction and e-agreement signing via OTP-based authentication.\n- Integration with core banking for disbursement.\n\n##### 3.1.2 Process Steps\n\n- Responsive web app for self-service journey\n- Aadhaar/PAN card OCR and verification\n- Credit score fetching from Experian or CIBIL\n- Eligibility rules based on income, credit history, and existing liabilities\n- Risk scoring using internal AI model\n- E-sign integration using DigiLocker + Aadhaar eKYC\n- Dashboard for customer to track loan status\n\n#### 3.2 System orchestration requirements\n\nFile Storage: To be defined\n\nOutput File Library: To be defined\n\n#### 3.3 UI/UX Requirements (MVP -1)\n\nLogin Screen: Users are expected to log in using Single Sign-On (SSO) when accessing. This login mechanism enhances security and streamlines the authentication process.\n\nUser Role-Based Access: \n\n- Manager Role: Managers should be granted access to cases, empowering them to utilize both the upload and download functionalities of the automation. This role ensures that managerial users have the necessary permissions for case-related activities.\n- Admin Role: Admin access, reserved for select team members, provides comprehensive access to the entire application. This privileged role is designated for individuals who require full control and oversight of the application's functionalities.\n\n#### 3.4 Non-Functional Requirements\n\n- Audit Trail: A comprehensive audit trail will be maintained to track user activities within the application. This includes capturing user-specific information such as usernames, date and time stamps, and the type of activities performed.\n- Monitoring and Reporting: The system will collect log data to monitor the number of active users and track individual usernames. Additionally, performance metrics of the application will be recorded.\n- Security: User authentication will be implemented using secure protocols. This security measure ensures that only authenticated users with proper credentials can access the system, enhancing overall system security.\n- Reliability: The system is committed to maintaining a minimum uptime, excluding scheduled maintenance.\n\n### 4. To Be Process\n\nAnticipated Procedural Steps for MVP -1:\n\n- The Team initializes the application login procedure upon receipt of emails.\n- Subsequently, the team systematically transfers files, utilizing them as inputs for the designated tool.\n\n#### 4.1 Process Steps\n\n- Step-by-step guide for process information.\n\n### 5. Assumptions\n\n- Customer must have Aadhaar-linked mobile number\n- System must support English and Hindi\n- Loan disbursement only through verified bank accounts\n\n### 6. Inclusions and Exclusions\n\nInclusions of the project are as follows:\n\n- Online loan application form with Aadhaar/PAN-based prefill.\n- Integration with credit bureau (CIBIL) to fetch credit score.\n- AI-based eligibility and risk assessment module.\n- Real-time KYC document verification (OCR + face match).\n- Loan sanction and e-agreement signing via OTP-based authentication.\n- Integration with core banking for disbursement.\n\nExclusions for the project:\n\n- Home loan, car loan, and business loan modules.\n- Agent-assisted journeys for Tier 3 regions.\n\n### 7. Data Sources\n\n#### 7.1 Input data sources\n\nTo be defined\n\n#### 7.1.1 Key volumetrics of the as-is User Flow\n\nTo be defined\n\n#### 7.2 Output data sources\n\nTo be defined\n\n### 8. Glossary of Data\n\nTo be defined\n\n## Compliance Rules\n\n| Rule ID | Description | Category | Severity | Applicable Standards |\n|---------|-------------|----------|----------|-----------------------|\n| R1      | The system must securely store and process Aadhaar and PAN card details. | Security | High | ISO 27001 |\n| R2      | The system must ensure real-time KYC document verification using OCR and face match. | Operational | High | ISO 27001 |\n| R3      | The system must integrate with credit bureau (CIBIL) to fetch credit score. | Data | High | ISO 27001 |\n| R4      | The system must implement AI-based eligibility and risk assessment module. | Operational | High | ISO 27001 |\n| R5      | The system must allow loan sanction and e-agreement signing via OTP-based authentication. | Security | High | ISO 27001 |\n| R6      | The system must integrate with core banking for disbursement. | Operational | High | ISO 27001 |\n| R7      | The system must provide a responsive web app for self-service journey. | Operational | Medium | ISO 27001 |\n| R8      | The system must provide a dashboard for customer to track loan status. | Operational | Medium | ISO 27001 |\n| R9      | The system must maintain a comprehensive audit trail to track user activities within the application. | Security | High | ISO 27001 |\n| R10     | The system must collect log data to monitor the number of active users and track individual usernames. | Security | High | ISO 27001 |\n| R11     | The system must implement user authentication using secure protocols. | Security | High | ISO 27001 |\n| R12     | The system must maintain a minimum uptime, excluding scheduled maintenance. | Operational | High | ISO 27001 |\n| R13     | The system must support English and Hindi languages. | Operational | Medium | ISO 27001 |\n| R14     | The system must disburse loans only through verified bank accounts. | Legal | High | ISO 27001 |\n| R15     | The system must exclude home loan, car loan, and business loan modules. | Operational | Low | ISO 27001 |\n| R16     | The system must exclude agent-assisted journeys for Tier 3 regions. | Operational | Low | ISO 27001 |",
    "pdf_path": "generated_pdf\\generated_brd.pdf"
  }
}