{
  "rules": {
    "brd_text": "# Project Name: Digital Loan Application and Approval System\n\n## Business Requirement Document\n\n### Contents\n1. Background\n2. As-is Process\n3. Business Requirements\n   1. Functional Requirements\n   2. System Orchestration Requirements\n   3. UI/UX Requirements\n   4. Non-Functional Requirements\n4. To Be Process\n5. Assumptions\n6. Inclusions and Exclusions\n7. Data Sources\n   1. Input Data Sources\n   2. Output Data Sources\n8. Glossary of Data\n\n## 1. Background\nThe loan application process at XYZ Bank is currently manual, paper-based, and requires customers to visit branches physically. This has led to increased turnaround time (TAT), frequent errors, and poor customer experience. The management wants to digitize the entire loan origination process for personal loans.\n\n## 2. As-is Process\nThe current process is manual and paper-based, requiring physical visits to the bank branches. This process is not represented in a diagram.\n\n## 3. Business Requirements\n### 3.1 Functional Requirements\n- Online loan application form with Aadhaar/PAN-based prefill.\n- Integration with credit bureau (CIBIL) to fetch credit score.\n- AI-based eligibility and risk assessment module.\n- Real-time KYC document verification (OCR + face match).\n- Loan sanction and e-agreement signing via OTP-based authentication.\n- Integration with core banking for disbursement.\n\n### 3.2 System Orchestration Requirements\n- File Storage: To be defined\n- Output File Library: To be defined\n\n### 3.3 UI/UX Requirements\n- Responsive web app for self-service journey\n- Dashboard for customer to track loan status\n\n### 3.4 Non-Functional Requirements\n- System must support English and Hindi\n- Loan disbursement only through verified bank accounts\n\n## 4. To Be Process\nThe anticipated procedural steps for the new process are as follows:\n- Customer fills the online loan application form.\n- System fetches credit score from CIBIL.\n- System performs AI-based eligibility and risk assessment.\n- System performs real-time KYC document verification.\n- System sanctions loan and facilitates e-agreement signing via OTP-based authentication.\n- System integrates with core banking for disbursement.\n\n## 5. Assumptions\n- Customer must have Aadhaar-linked mobile number.\n\n## 6. Inclusions and Exclusions\n### Inclusions\n- Online loan application form with Aadhaar/PAN-based prefill.\n- Integration with credit bureau (CIBIL) to fetch credit score.\n- AI-based eligibility and risk assessment module.\n- Real-time KYC document verification (OCR + face match).\n- Loan sanction and e-agreement signing via OTP-based authentication.\n- Integration with core banking for disbursement.\n\n### Exclusions\n- Home loan, car loan, and business loan modules.\n- Agent-assisted journeys for Tier 3 regions.\n\n## 7. Data Sources\n### 7.1 Input Data Sources\nTo be defined\n\n### 7.2 Output Data Sources\nTo be defined\n\n## 8. Glossary of Data\nTo be defined\n\nErnst & Young LLP\nEY | Building a better working world\nAbout EY\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\nEY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. Information about how EY collects and uses personal data and a description of the rights individuals have under data protection legislation are available via ey.com/privacy. EYG member firms do not practice law where prohibited by local laws. For more information about our organization, please visit ey.com.\nErnst & Young LLP is one of the Indian client serving member firms of EYGM Limited. For more information about our organization, please visit www.ey.com/en_in.\nErnst & Young LLP is a Limited Liability Partnership, registered under the Limited Liability Partnership Act, 2008 in India, having its registered office at Ground Floor, Plot No. 67, Institutional Area, Sector - 44, Gurugram - 122 003, Haryana, India.\n© 2023 Ernst & Young LLP. Published in India.\nAll Rights Reserved.\nED None\nThis publication contains information in summary form and is therefore intended for general guidance only. It is not intended to be a substitute for detailed research or the exercise of professional judgment. Neither EYGM Limited nor any other member of the global Ernst & Young organization can accept any responsibility for loss occasioned to any person acting or refraining from action as a result of any material in this publication. On any specific matter, reference should be made to the appropriate advisor.\n\n## Compliance Rules\n\n| Rule ID | Description | Category | Severity | Applicable Standards |\n|---------|-------------|----------|----------|-----------------------|\n| R1 | The system must have a secure online loan application form with Aadhaar/PAN-based prefill. | Security | High | ISO 27001 |\n| R2 | The system must securely integrate with credit bureau (CIBIL) to fetch credit score. | Security | High | ISO 27001 |\n| R3 | The AI-based eligibility and risk assessment module must comply with fair lending laws and regulations. | Legal | High | Fair Lending Laws |\n| R4 | The system must perform real-time KYC document verification (OCR + face match) in compliance with local and international KYC regulations. | Legal | High | KYC Regulations |\n| R5 | The system must facilitate loan sanction and e-agreement signing via OTP-based authentication, ensuring the confidentiality and integrity of the process. | Security | High | ISO 27001 |\n| R6 | The system must integrate with core banking for disbursement in a secure manner. | Security | High | ISO 27001 |\n| R7 | The system must support English and Hindi languages, ensuring the accuracy of translations and compliance with local language laws. | Legal | Medium | Local Language Laws |\n| R8 | Loan disbursement should only be through verified bank accounts, ensuring the legitimacy of the transaction. | Operational | High | AML Regulations |\n| R9 | The system must ensure that the customer has an Aadhaar-linked mobile number. | Data | Medium | Aadhaar Act |\n| R10 | The system must exclude home loan, car loan, and business loan modules, and agent-assisted journeys for Tier 3 regions. | Operational | Low | N/A |\n| R11 | The system must ensure the privacy and security of input and output data sources. | Security | High | GDPR, ISO 27001 |\n| R12 | The system must ensure that the responsive web app for self-service journey and dashboard for customer to track loan status are user-friendly and accessible. | Operational | Medium | WCAG 2.1 |\n| R13 | The system must ensure that all data collected and processed is in compliance with data protection laws and regulations. | Data | High | GDPR |",
    "pdf_path": "generated_pdf\\generated_brd.pdf"
  }
}